dicas.org
y# -*- coding: utf-8 after-save-hook: (lambda nil (org-html-export-to-html)) -*-
#+INFOJS_OPT: path:org-info.js view:overview toc:nil ltoc:nil
#+OPTIONS: H:2
#+STARTUP: showeverything
#+LANGUAGE: pt
#+HTML_HEAD: <link href="https://fonts.googleapis.com/css?family=Ubuntu:400,700" rel="stylesheet" type="text/css">
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="https://urionlinejudge.r.worldssl.net/repository/contest.css" />
#+HTML_HEAD_EXTRA: <style type="text/css"> p{ margin-top: 1em; margin-bottom: 1em; } </style>
#+TITLE: Clube de Programação
#+SUBTITLE: Repositório de Dicas para Problemas
#+AUTHOR: Leandro Zatesko, João Paulo Castilho

Os problemas a seguir não estão ordenados nem lexicográfica nem
numericamente, mas por ordem de inclusão neste arquivo. Utilize as
ferramentas de seu navegador para localizar as dicas para um problema
específico.

Achou algum erro ou tem alguma consideração sobre alguma coisa nesta
página? Mande-nos um [[mailto:jpwbernardi@hotmail.com][email]].

Esta página foi desenvolvida com o [[http://orgmode.org/][Org Mode]] do [[https://www.gnu.org/software/emacs/][Emacs]].

* DICAS GERAIS

  - Pratique muito, tanto sozinho quanto com seu time! Nada de "dividir"
    os tópicos entre os membros do time! Todos precisam ser bons em
    tudo, ou o time não conseguirá compor soluções que envolvem vários
    conteúdos! Você precisa desenvolver suas habilidades de codar rápido
    e codar certo.

  - Nos treinos, simule todas as condições da competição. Que o time use
    só uma máquina para codar, e outras máquinas só para ler os
    problemas, e que o material de consulta seja apenas o impresso (já
    vá organizando seu caderninho!)

  - Nunca ocupe a máquina se você não tem uma solução completamente
    pronta (esboçada no papel ou na sua cabeça) para codar, com a
    garantia de que ela está correta e de que tem a complexidade
    esperada (dimensionar o quanto sua solução vai consumir de tempo e
    de memória é importantíssimo! não perca tempo codando algo
    impossível de passar no time limit!)

  - É estratégia dominante para minimizar a soma dos tempos das
    submissões aceitas (e, portanto, maximizar o número de problemas
    passados na prova) resolver primeiro os problemas mais fáceis (ou
    melhor, que o time leva menos tempo para passar). Então, comecem
    cada um trabalhando num problema diferente, revezando-se no uso da
    máquina, e deixem para concentrar esforços de dois ou mais
    integrantes trabalhando num só problema mais para o final da
    prova. No começo, pegue cada um uma parte da prova para ler e achar
    rápido os problemas mais fáceis. Fique também sempre atento ao
    placar, para ver o que os outros times estão resolvendo (isso pode
    ser um indicativo de quais são os problemas mais fáceis!)

  - Após não conseguir resolver um problema na competição ou no treino,
    estude o conteúdo referente àquele problema durante a semana e tente
    novamente até conseguir passá-lo. Perseverar é importantíssimo.

  - O ideal é ter um treino zerado antes do próximo treino. Se acontecer
    de ficarem alguns problemas para trás, foque primeiro nos problemas
    do treino corrente, depois ponha sua lição de casa em dia.

  - Devore livros e materiais específicos de Programação Competitiva,
    especialmente [[http://cpbook.net/][este livro]].

  - Não leia as dicas de um problema sem antes refletir sobre o problema
    o suficiente. Se você treina no sábado, sugiro pelo menos no domingo
    ainda tentar resolver os problemas sem as dicas. Abra as dicas
    apenas na segunda-feira, e olhe códigos na Internet apenas em último
    caso ;)

  - Após passar um problema, veja códigos na Internet e dos seus colegas
    que também passaram um problema para ver como você poderia ter feito
    diferente (mais simples, mais curto, mais elegante, menos propenso a
    bugs).

  - Não seja malloqueiro! Deixe a STL do C++ cuidar da alocação dinâmica
    para você quando precisar dela! Desenvolva práticas de código que
    ajudem no debug, se você precisar! Algumas sugestões:

    -- Escreva uma função do começo ao fim, deixando para implementar as
    subrotinas depois.

    -- Modularize seu código para que as funções sejam curtas, bem
    escritas, sem precisar de comentários para serem legíveis, e sem um
    número exagerado de níveis de indentação.

    -- Jamais escreva uma porção de código que faz a mesma coisa
    trocando apenas os papéis das variáveis. Estruture melhor suas
    macros e os cabeçalhos das funções então (e.g. movimentos das peças
    do xadrez!)

    -- Defina constantes no cabeçalho do código, ao invés de colocar
    números absolutos nas funções.

    -- Use alocação estática sempre que puder, e sempre com folga nos
    tamanhos dos arrays.

    -- Trabalhe com inteiros sempre que puder, tomando sempre o cuidado
    com somas e produtos acumulados (eles cabem em 32 bits?)

* URI 2006 Identifying Tea

  Dispensa dicas.

* URI 1961 Jumping Frog

  Dispensa dicas.

* URI 1847 Welcome to the Winter!

  Dispensa dicas. Só tome cuidado para ler o problema e garantir que
  você interpretando os casos corretamente ;)

