dicas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt" xml:lang="pt">
<head>
<!-- 2017-09-21 qui 19:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Clube de Programação</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Leandro Zatesko, João Paulo Castilho" />
<link href="https://fonts.googleapis.com/css?family=Ubuntu:400,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" type="text/css" href="https://urionlinejudge.r.worldssl.net/repository/contest.css" />

</head>
<body>
<div id="content">
<h1 class="title">Clube de Programação
<br />
<span class="subtitle">Repositório de Dicas para Problemas</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org88c97d4">1. DICAS GERAIS</a></li>
<li><a href="#org97e4a0a">2. URI 2006 Identifying Tea</a></li>
<li><a href="#orgf51f243">3. URI 1961 Jumping Frog</a></li>
<li><a href="#org047c80e">4. URI 1847 Welcome to the Winter!</a></li>
<li><a href="#org479bb0b">5. URI 1563 The Big Problem</a></li>
<li><a href="#org46352d0">6. URI 1137 Cocircular Points</a></li>
<li><a href="#org0a1fb24">7. URI 1863 Ramsay's Counter-attack</a></li>
<li><a href="#org59c3104">8. URI 1753 Knights Of The Round Table</a></li>
<li><a href="#org149105d">9. URI 1491 Blogger Language</a></li>
<li><a href="#orgd7dfb90">10. URI 1427 The Scrooge Co Problem</a></li>
<li><a href="#org0bcf355">11. URI 1915 Help Chaves</a></li>
<li><a href="#org9b582bc">12. UVA 13018 Dice Cup</a></li>
<li><a href="#org549b71c">13. UVA 13025 Back to the Past</a></li>
<li><a href="#org23bd58b">14. UVA 665 False Coins</a></li>
<li><a href="#orgf4729c4">15. UVA 12005 Bubble Sort</a></li>
<li><a href="#org40069eb">16. UVA 11048 Automatic Correction of Misspellings</a></li>
<li><a href="#org720398d">17. UVA 10739 String to Palindrome</a></li>
<li><a href="#org3432c15">18. UVA 10192 Vacation</a></li>
<li><a href="#org390066f">19. UVA 11258 String Partition</a></li>
<li><a href="#org61042a4">20. UVA 10891 Game of Sum</a></li>
<li><a href="#org75377a0">21. UVA 11610 Reverse Prime</a></li>
<li><a href="#org368ad36">22. URI 1634 Another Lottery</a></li>
<li><a href="#org663da0b">23. URI 2014 Blood Groups</a></li>
<li><a href="#org7eb0f35">24. URI 1671 Code</a></li>
<li><a href="#org0165a2b">25. URI 1748 Fence the Vegetables</a></li>
<li><a href="#org7cc1590">26. URI 2007 Fence the Vegetables Fail</a></li>
<li><a href="#org12a9622">27. URI 2012 Height Map</a></li>
<li><a href="#orgc5f71fa">28. URI 1752 Journey Through The Kingdom</a></li>
<li><a href="#org9e8018e">29. URI 2009 Just a bit sorted</a></li>
<li><a href="#org99dddec">30. URI 2030 Pit Stop</a></li>
<li><a href="#org8460712">31. URI 2031 Rock, Paper, Airstrike</a></li>
<li><a href="#orgcc34cc8">32. UVA 13049 Combination Lock</a></li>
<li><a href="#org94ad572">33. UVA 11094 Continents</a></li>
<li><a href="#org55287c2">34. UVA 11357 Ensuring Truth</a></li>
<li><a href="#orgf05c5ed">35. UVA 11475 Extend to Palindromes</a></li>
<li><a href="#orga251fab">36. UVA 622 Grammar Evaluation</a></li>
<li><a href="#orgcf45068">37. UVA 10859 Placing Lampposts</a></li>
<li><a href="#org5020c01">38. UVA 12542 Prime Substring</a></li>
<li><a href="#org836127a">39. UVA 13026 Search the Khoj</a></li>
<li><a href="#org1b7b422">40. UVA 11319 Stupid Sequence?</a></li>
<li><a href="#org49cb24d">41. UVA 488 Triangle Wave</a></li>
<li><a href="#orgba62cd5">42. LA 5057 Worst Location</a></li>
<li><a href="#org3740aed">43. LA 5058 Counting BST</a></li>
<li><a href="#orge7e2915">44. LA 5059 Playing With Stones</a></li>
<li><a href="#orge23c355">45. LA 5060 Arm Wrestling Tournament</a></li>
<li><a href="#org7c32c03">46. LA 5061 Lightning Energy Report</a></li>
<li><a href="#org94ef91e">47. LA 5062 Transitive Closure</a></li>
<li><a href="#org345554c">48. LA 5063 Just Sum It</a></li>
<li><a href="#org099b080">49. LA 5064 Serial Numbers</a></li>
<li><a href="#org7414c31">50. LA 5065 Romantic Date</a></li>
<li><a href="#orga8e32ec">51. LA 5066 Fire Drill</a></li>
<li><a href="#org84e379a">52. URI 1912 Help Seu Madruga</a></li>
<li><a href="#orgfd2bc5f">53. URI 1856 Arya's Death List</a></li>
<li><a href="#org7402973">54. URI 1852 Stark Direwolves</a></li>
<li><a href="#org46545ab">55. LA 7580 Forever Young</a></li>
<li><a href="#org985fe79">56. CF 670D{1, 2} Magic Powder</a></li>
<li><a href="#orgd3f54c3">57. URI 2036 Efeito Dominó</a></li>
<li><a href="#orga1726d2">58. URI 2351 Hotel Rewards</a></li>
<li><a href="#org4a6d629">59. URI 2349 Farm Robot</a></li>
<li><a href="#org83f389d">60. URI 1034 Ice Statues Festival</a></li>
</ul>
</div>
</div>
<p>
y# -<b>- coding: utf-8 after-save-hook: (lambda nil (org-html-export-to-html)) -</b>-
</p>
<p>
Os problemas a seguir não estão ordenados nem lexicográfica nem
numericamente, mas por ordem de inclusão neste arquivo. Utilize as
ferramentas de seu navegador para localizar as dicas para um problema
específico.
</p>

<p>
Achou algum erro ou tem alguma consideração sobre alguma coisa nesta
página? Mande-nos um <a href="mailto:jpwbernardi@hotmail.com">email</a>.
</p>

<p>
Esta página foi desenvolvida com o <a href="http://orgmode.org/">Org Mode</a> do <a href="https://www.gnu.org/software/emacs/">Emacs</a>.
</p>

<div id="outline-container-org88c97d4" class="outline-2">
<h2 id="org88c97d4"><span class="section-number-2">1</span> DICAS GERAIS</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Pratique muito, tanto sozinho quanto com seu time! Nada de "dividir"
os tópicos entre os membros do time! Todos precisam ser bons em
tudo, ou o time não conseguirá compor soluções que envolvem vários
conteúdos! Você precisa desenvolver suas habilidades de codar rápido
e codar certo.</li>

<li>Nos treinos, simule todas as condições da competição. Que o time use
só uma máquina para codar, e outras máquinas só para ler os
problemas, e que o material de consulta seja apenas o impresso (já
vá organizando seu caderninho!)</li>

<li>Nunca ocupe a máquina se você não tem uma solução completamente
pronta (esboçada no papel ou na sua cabeça) para codar, com a
garantia de que ela está correta e de que tem a complexidade
esperada (dimensionar o quanto sua solução vai consumir de tempo e
de memória é importantíssimo! não perca tempo codando algo
impossível de passar no time limit!)</li>

<li>É estratégia dominante para minimizar a soma dos tempos das
submissões aceitas (e, portanto, maximizar o número de problemas
passados na prova) resolver primeiro os problemas mais fáceis (ou
melhor, que o time leva menos tempo para passar). Então, comecem
cada um trabalhando num problema diferente, revezando-se no uso da
máquina, e deixem para concentrar esforços de dois ou mais
integrantes trabalhando num só problema mais para o final da
prova. No começo, pegue cada um uma parte da prova para ler e achar
rápido os problemas mais fáceis. Fique também sempre atento ao
placar, para ver o que os outros times estão resolvendo (isso pode
ser um indicativo de quais são os problemas mais fáceis!)</li>

<li>Após não conseguir resolver um problema na competição ou no treino,
estude o conteúdo referente àquele problema durante a semana e tente
novamente até conseguir passá-lo. Perseverar é importantíssimo.</li>

<li>O ideal é ter um treino zerado antes do próximo treino. Se acontecer
de ficarem alguns problemas para trás, foque primeiro nos problemas
do treino corrente, depois ponha sua lição de casa em dia.</li>

<li>Devore livros e materiais específicos de Programação Competitiva,
especialmente <a href="http://cpbook.net/">este livro</a>.</li>

<li>Não leia as dicas de um problema sem antes refletir sobre o problema
o suficiente. Se você treina no sábado, sugiro pelo menos no domingo
ainda tentar resolver os problemas sem as dicas. Abra as dicas
apenas na segunda-feira, e olhe códigos na Internet apenas em último
caso ;)</li>

<li>Após passar um problema, veja códigos na Internet e dos seus colegas
que também passaram um problema para ver como você poderia ter feito
diferente (mais simples, mais curto, mais elegante, menos propenso a
bugs).</li>

<li><p>
Não seja malloqueiro! Deixe a STL do C++ cuidar da alocação dinâmica
para você quando precisar dela! Desenvolva práticas de código que
ajudem no debug, se você precisar! Algumas sugestões:
</p>

<p>
&#x2013; Escreva uma função do começo ao fim, deixando para implementar as
subrotinas depois.
</p>

<p>
&#x2013; Modularize seu código para que as funções sejam curtas, bem
escritas, sem precisar de comentários para serem legíveis, e sem um
número exagerado de níveis de indentação.
</p>

<p>
&#x2013; Jamais escreva uma porção de código que faz a mesma coisa
trocando apenas os papéis das variáveis. Estruture melhor suas
macros e os cabeçalhos das funções então (e.g. movimentos das peças
do xadrez!)
</p>

<p>
&#x2013; Defina constantes no cabeçalho do código, ao invés de colocar
números absolutos nas funções.
</p>

<p>
&#x2013; Use alocação estática sempre que puder, e sempre com folga nos
tamanhos dos arrays.
</p>

<p>
&#x2013; Trabalhe com inteiros sempre que puder, tomando sempre o cuidado
com somas e produtos acumulados (eles cabem em 32 bits?)
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org97e4a0a" class="outline-2">
<h2 id="org97e4a0a"><span class="section-number-2">2</span> URI 2006 Identifying Tea</h2>
<div class="outline-text-2" id="text-2">
<p>
Dispensa dicas.
</p>
</div>
</div>

<div id="outline-container-orgf51f243" class="outline-2">
<h2 id="orgf51f243"><span class="section-number-2">3</span> URI 1961 Jumping Frog</h2>
<div class="outline-text-2" id="text-3">
<p>
Dispensa dicas.
</p>
</div>
</div>

<div id="outline-container-org047c80e" class="outline-2">
<h2 id="org047c80e"><span class="section-number-2">4</span> URI 1847 Welcome to the Winter!</h2>
<div class="outline-text-2" id="text-4">
<p>
Dispensa dicas. Só tome cuidado para ler o problema e garantir que
você interpretando os casos corretamente ;)
</p>
</div>
</div>
