dicas.org
* URI 1563 The Big Problem

  Se fixamos um $N$ e um $A\in\{1,N\}$, o número de pares $(A,B)$ tais
  que $B>1$ e $B\leq N\mathbin{\text{mod}} A$ é obviamente
  $N\mathbin{\text{mod}} A$. Então, o que o problema pede, dado $N$, é
  simplesmente a fração $\rho(N)/N^2$, simplificada usando o
  [[https://en.wikipedia.org/wiki/Euclidean_algorithm][Algoritmo de Euclides]]
  (Cuidado, porque a resposta pode não caber em 32 bits!),
  sendo
  $\rho(N)=\sum_{i=1}^N(N\mathbin{\text{mod}} i)$. Como
  $N\leq 10^8$, computar $S(N)$ de um modo ingênuo é inviável, mesmo
  que a entrada consistisse de um só caso de teste. Vamos precisar
  manipular $\rho(N)$ um pouco.

  Primeiro observemos que
  $(N\mathbin{\text{mod}} i) - ((N-1)\mathbin{\text{mod}} i)$ é:
  $1$, se $i$ não
  divide $N$; $1-i$, caso contrário. Assim, tentando estabelecer uma
  recorrência para $\rho(N)$ (lembrando que $\sigma(N)$ é a soma dos
  divisores de $N$):

  \begin{gather*}
  \rho(N)-\rho(N-1) = \sum_{i\text{ não divisor de }N}1
  +\sum_{i\text{ divisor próprio de }N}(1-i)
  = \sum_{i=1}^{N-1}1-\sum_{i\text{ divisor próprio de }N}i\\
  = N - 1 - \sum_{i\text{ divisor de }N}i + N = 2N - 1 - \sigma(N)
  \end{gather*}

  Então, a recorrência é:
  $\rho(N) = 2N-1-\sigma(N)+\rho(N - 1)$. Resolvendo:

  \begin{equation*}
  \rho(N) = \sum_{i=1}^N(2i-1-\sigma(i))
  =2\sum_{i=1}^Ni-N-\sum_{i=1}^N\sigma(i)=N^2-\sum_{i=1}^N\sigma(i)
  \end{equation*}

  Então, nosso problema agora se resume a computar
  $\sum_{i=1}^N\sigma(i)$. Uma vez computada essa soma, podemos obter
  $\rho(N)$ em $O(1)$. Deixo a cargo de vocês agora
  [[http://mathoverflow.net/questions/195325/how-to-calculate-the-sum-of-remainders-of-n][pesquisar]] como
  calcular essa soma em tempo $O(\sqrt N)$ ;)

  - Complexidade: $O(\sqrt N)$

* URI 1137 Cocircular Points

  O que o problema pede, dado um conjunto de pontos, é o maior número de
  pontos que são cocirculares. O que se deve ter em mente é que cada
  conjunto de pontos não-colineares (podemos verificar facilmente se
  três
  pontos são colineares através de produto vetorial) define uma única
  circunferência.
  Então, iterando sobre todos os conjuntos de três pontos
  não-colineares, podemos simplesmente adicionar ao final de um vetor a
  circunferência definida
  por estes três pontos. No final, ordenando o vetor,
  podemos verificar que, se uma mesma circunferência
  aparecer $k$ vezes no vetor, podemos obter o número $p$ de pontos da
  entrada
  que
  pertencem a esta circunferência através da equação $k=\binom p3$ (dica
  extra pra resolver a equação: busca na 3^a
  coluna do Triângulo de Pascal).

  - Complexidade: como no pior caso cada tripla de pontos pode definir
    uma circunferência distinta, $O(N^3\log N)$. Embora eu mesmo tenha
    submetido um código $O(N^4)$ no URI (não meu) e passado :P

* URI 1863 Ramsay's Counter-attack

  #+BEGIN_QUOTE
  /Dicas escritas pelo Prof. Ricardo Oliveira, autor do problema./
  #+END_QUOTE

  O problema pode ser resolvido por programação dinâmica. Cada estado consiste
  apenas de um soldado $[u]$, e responde o tamanho da maior sequência terminando
  nele. Seu cálculo é dado por $1 + \max(PD[u'])$, onde $u'$ é um soldado posicionado a
  sudoeste de $u$ e é mais forte que $u$.

  Entretanto, o cálculo de cada estado não pode ser feito em tempo
  linear em $N$, uma vez    que isto tornaria todo o algoritmo
  quadrático em $N$.

  Entretanto, é possível manter um conjunto $S$, tal que, quando o
  estado $[u]$
  for
  visitado, $S$ contém exatamente todos os soldados mais fortes que
  $u$. Para tal, é
  possível inverter o grafo dado (i.e. criar um arco $i\to j$ quando $i$
  é mais fraco
  que $j$).
  Note que este grafo é uma floresta. É feita então uma busca em
  profundidade (DFS).
  Quando o vértice $u$ for visitado, o conjunto $S$
  será dado pelos vértices atualmente
  na pilha. Logo, um vértice deve ser incluído em $S$
  ao ser empilhado, e removido de
  $S$ ao ser desempilhado.

  Por fim, é necessário, em cada estado $[u]$,
  consultar os vértices que estão em $S$
  e que estão a sudoeste de $u$.
  Isto pode ser feito com uma árvore de segmentos
  2D.
  As respostas dos estados $[u']$ são inseridas (removidas) da
  estrutura quando o vértice é inserido em (removido de) $S$.
  O máximo das respostas
  dos vértices a sudoeste de $u$
  é dado pela consulta pelo retângulo
  $[-400,-400,x[u]-1, y[u]-1]$.

  Embora a Quad-tree também possa ser utilizada, sua constante é consideravelmente
  maior que a árvore de segmentos,
  o que pode ocasionar em TLE, dependendo da
  implementação.

  - Complexidade: $O(N\log^2(800)) = O(N)$ considerando uma constante.

* URI 1753 Knights Of The Round Table

  Este foi o Problema K da Nacional de 2014. Veja a discussão
  sobre ele [[http://codeforces.com/blog/entry/14650][neste link]].

* URI 1491 Blogger Language

  Este foi o Problema B da Nacional de 2013. Veja comentários
  sobre ele
  [[https://chococontest.wordpress.com/2013/11/15/solucionario-regional-south-america-2013/][neste link]].

* URI 1427 The Scrooge Co Problem

  O problema em questão é o clássico
  Weighted SSSP (Single-Source Shortest
  Path), pedindo para imprimir também o caminho, não só o custo do
  caminho mínimo.
  Se resolver com Dijkstra, passa tranquilamente. No entanto,
  observe que o grafo é pequeno (menos de 100 vértices) e que são também
  poucos casos de teste (menos de 100). Assim, até Floyd-Warshall deve
  passar, e o código do Floyd-Warshall é mais simples e mais curto (4
  linhas!) que o código do Dijkstra, sendo bem tranquilo também
  recuperar o caminho com o Floyd-Warshall.

  - Complexidade: $O(N^3)$

* URI 1915 Help Chaves

  Crie um grafo bipartido $(A\cup B,E)$ em que $A$ seja o conjunto dos
  $N$ amigos e $B$ o conjunto dos $M$ brinquedos. Para cada par
  $(a,b)\in A\times B$, calcule (via PD) a "distância de edição"
  de $a$
  para $b$. Se essa distância for um número múltiplo de 5, crie a
  aresta; senão, não. Depois de o grafo estar montado, é só rodar seu
  algoritmo preferido de emparelhamentos máximos em grafos bipartidos
  (até FFEK serve!).

  - Complexidade: $O(100^2NM)$ para montar o grafo (o $100^2$ é o custo
    de cada PD, já que as palavras têm no máximo 100 caracteres)
    $+$ $O(NM)$ para o FFEK. Não fique com medo de $100^2NM$ ser
    $\approx 10^8$ no pior caso de $N$ e de $M$ ;)

