dicas.org
* UVA 13018 Dice Cup

  Problema muito fácil. Perceba que os valores de $N$ e de $M$ são
  pequenos. Então, testar todas as possibilidades de soma entre os
  inteiros e ver quais são as que mais ocorrem é totalmente factível.

  Se você ainda é iniciante e tem dificuldade em implementar esta
  solução, vou dar um pouco mais de detalhes: Crie um vetor $V$
  de inteiros com
  pelo menos 40 posições, já que 40 é o
  valor máximo  possível para uma soma de dois d20. Em cada caso de
  teste, zere esse vetor. Então, comece um for sobre uma variável $i$ de
  1 até $N$ e aninhe dentro desse for um for sobre uma variável $j$ de 1
  até $M$, incrementando $V[i+j]$ a cada iteração. No final, basta
  varrer todo o vetor $V$ para identificar qual valor ocorre mais vezes
  (ou seja, qual índice $i$ tem $V[i]$ máximo)
  e varrer uma segunda vez para imprimir todos os valores que ocorrem
  esse número máximo de vezes.

  Para imprimir uma linha de branco entre casos de teste consecutivos,
  você pode utilizar uma flag ~first~ (que começa valendo 1)
  e, antes de dar a saída para um caso
  de teste, fazer:

  #+BEGIN_SRC cpp
  if (first) first = 0;
  else printf("\n");
  #+END_SRC

  - Complexidade: $O(NM)$.

* UVA 13025 Back to the Past

  Dispensa comentários :P

* UVA 665 False Coins

  Dicas podem ser encontradas na página 40 do livro dos Halim (3^a
  edição).

* UVA 12005 Bubble Sort

  Assumamos sem perda de generalidade que estamos trabalhando com uma
  permutação $\pi$ de $\{1,\dotsc,n\}$ tomada sob distribuição
  uniforme (o problema garante que você pode assumir que os inteiros no
  array são todos distintos, o que facilita).
  Seja $X$ a [[https://en.wikipedia.org/wiki/Random_variable][variável aleatória]] que assume o número de inversões numa
  dada permutação $\pi$, i.e. o número de pares $(i,j)$ tais que
  $i < j$
  e $\pi(i) > \pi(j)$. É óbvio que o que o problema pede, o número
  esperado de trocas do [[https://en.wikipedia.org/wiki/Bubble_sort][Bubble Sort]] para ordenar $\pi$, é
  $\mathbb E(X)$, i.e. o [[https://en.wikipedia.org/wiki/Expected_value][valor esperado]] de $X$. Sendo
  $Y_{ij}$ a variável aleatória que assume o valor 1 se o par $(i,j)$ é
  uma inversão, ou 0 caso contrário, temos obviamente que

  \begin{equation*}
  \mathbb E(X) = \mathbb E\biggl(\sum_{i}\sum_{j>i} Y_{ij}\biggr).
  \end{equation*}

  Da [[https://en.wikipedia.org/wiki/Expected_value#Linearity][linearidade da esperança]]:

  \begin{equation*}
  \mathbb E(X) = \sum_{i}\sum_{j>i} \mathbb E(Y_{ij}).
  \end{equation*}

  Deixo como exercício você continuar as contas e fechar uma fórmula
  $O(1)$ em função de $n$ para $\mathbb E(X)$.

  - Complexidade: $O(1)$ para o cálculo de $E(X)$ (denominador e
    numerador) $+$ $O(\log n)$ para o
    Algoritmo de Euclides (para simplificar a fração).

* UVA 11048 Automatic Correction of Misspellings

  Calouros, vocês têm totais condições para fazer este problema!
  Este problema não requer nenhum conhecimento especial para ser
  resolvido. Os mais experientes talvez tentariam aplicar a PD da
  distância de edição aqui, mas definitivamente não é necessário.

  Note que tanto o número de palavras no dicionário quanto o número de
  consultas é pequeno neste problema, assim como o tamanho das palavras
  envolvidas na brincadeira. Então, não precisam ser tão preciosistas
  em relação à complexidade da solução. A solução que eu apresento a
  seguir é a mais simples possível. Soluções mais eficientes existem,
  mas esta aqui já passa (e tranquilamente!).

  Para cada /query/ $s$, simplesmente itere sobre todas as palavras $w$ do
  dicionário. Se $s=w$ (pode usar a ~strcmp()~ da ~string.h~),
  aborte o laço ($s$ is correct). Se você
  conseguiu identificar que $s$ é /misspelling/ de $w$ (já vou explicar
  como fazer isso), memorize isso, mas não aborte o laço (pois pode ser
  que $s$ seja igual a um outro $w$ mais pra frente).

  Implementar a função que verifica se uma palavra $s_1$ é uma
  /misspelling/ de uma palavra $s_2$ pode ser um pouco complicado para
  iniciantes. É bem possível que você até consiga fazer o serviço, mas
  que seu código fique bem complicado. Nestas horas, pensar em recursão
  pode ajudar. A seguir apresento a minha função, que recebe duas
  strings $s_1$
  e $s_2$, de tamanhos respectivamente $t_1$ e $t_2$,
  e verifica se a string definida a partir da
  posição $i$ de $s_1$ é uma /misspelling/ da string definida a partir da
  posição $j$ de $s_2$. Na hora de chamar, é só fazer:

  #+BEGIN_SRC cpp
  if (misspelling(str, 0, strlen(str), word[i], 0, strlen(word[i]) // ...
  #+END_SRC

  Por favor, tente você desenvolver sua própria função. Olhe meu código
  só quando você já conseguir ter feito o seu, para ver como você
  poderia ter feito diferente. Tente também desenvolver um código
  iterativo (que no fim das contas não vai ser muito diferente do
  recursivo).

  #+BEGIN_SRC cpp
  int misspelling(char *s1, int i, int t1, char *s2, int j, int t2) {
    if (i == t1) return j == t2 - 1;
    if (j == t2) return i == t1 - 1;
    return !strcmp(s1 + i + 1, s2 + j) || !strcmp(s1 + i, s2 + j + 1) ||
      (s1[i] != s2[j] && !strcmp(s1 + i + 1, s2 + j + 1)) ||
      (s1[i] != s2[j] && s1[i] == s2[j + 1] && s1[i + 1] == s2[j] &&
       !strcmp(s1 + i + 2, s2 + j + 2)) || // sem perigo de seg fault :)
      (s1[i] == s2[j] && misspelling(s1, i + 1, t1, s2, j + 1, t2));
  }
  #+END_SRC

  - Complexidade: $O(nm\times 25^2)$; o $25^2$ se deve ao custo
    $O(t_1t_2)$ da minha função ~misspelling()~

* UVA 10739 String to Palindrome

  Este problema é muito fácil se você já conhece PD e
  [[https://en.wikipedia.org/wiki/Levenshtein_distance][distância de edição]] (e o clássico algoritmo de
  [[https://en.wikipedia.org/wiki/Needleman%E2%80%93Wunsch_algorithm][Needleman-Wunsch]]).
  Basta lembrar que um palíndromo é uma palavra
  igual ao seu reverso. Então, é evidente que
  a distância de edição de uma
  palavra até seu reverso seja o dobro da menor distância de edição
  desta palavra para algum palíndromo.

  - Complexidade: $O(1000^2)$, já que 1000 é o comprimento máximo de uma
    palavra da entrada.

* UVA 10192 Vacation

  Leia a Seção 6.5.2 (Longest Common Subsequence, LCS --- não confundir com
  Longest Common Substring, que também é abreviado LCS) do livro dos
  Halim, que reduz o problema ao problema de [[https://en.wikipedia.org/wiki/Levenshtein_distance][distância de edição]] (e,
  portanto, que pode ser resolvido com o clássico algoritmo de
  [[https://en.wikipedia.org/wiki/Needleman%E2%80%93Wunsch_algorithm][Needleman-Wunsch]]).

