dicas.html

<div id="outline-container-org9b582bc" class="outline-2">
<h2 id="org9b582bc"><span class="section-number-2">12</span> UVA 13018 Dice Cup</h2>
<div class="outline-text-2" id="text-12">
<p>
Problema muito fácil. Perceba que os valores de \(N\) e de \(M\) são
pequenos. Então, testar todas as possibilidades de soma entre os
inteiros e ver quais são as que mais ocorrem é totalmente factível.
</p>

<p>
Se você ainda é iniciante e tem dificuldade em implementar esta
solução, vou dar um pouco mais de detalhes: Crie um vetor \(V\)
de inteiros com
pelo menos 40 posições, já que 40 é o
valor máximo  possível para uma soma de dois d20. Em cada caso de
teste, zere esse vetor. Então, comece um for sobre uma variável \(i\) de
1 até \(N\) e aninhe dentro desse for um for sobre uma variável \(j\) de 1
até \(M\), incrementando \(V[i+j]\) a cada iteração. No final, basta
varrer todo o vetor \(V\) para identificar qual valor ocorre mais vezes
(ou seja, qual índice \(i\) tem \(V[i]\) máximo)
e varrer uma segunda vez para imprimir todos os valores que ocorrem
esse número máximo de vezes.
</p>

<p>
Para imprimir uma linha de branco entre casos de teste consecutivos,
você pode utilizar uma flag <code>first</code> (que começa valendo 1)
e, antes de dar a saída para um caso
de teste, fazer:
</p>

<div class="org-src-container">
<pre><code class="src src-cpp"><span style="color: #00bfff;">if</span> (first) first = 0;
<span style="color: #00bfff;">else</span> printf(<span style="color: #deb887;">"\n"</span>);
</code></pre>
</div>

<ul class="org-ul">
<li>Complexidade: \(O(NM)\).</li>
</ul>
</div>
</div>

<div id="outline-container-org549b71c" class="outline-2">
<h2 id="org549b71c"><span class="section-number-2">13</span> UVA 13025 Back to the Past</h2>
<div class="outline-text-2" id="text-13">
<p>
Dispensa comentários :P
</p>
</div>
</div>

<div id="outline-container-org23bd58b" class="outline-2">
<h2 id="org23bd58b"><span class="section-number-2">14</span> UVA 665 False Coins</h2>
<div class="outline-text-2" id="text-14">
<p>
Dicas podem ser encontradas na página 40 do livro dos Halim (3<sup>a</sup>
edição).
</p>
</div>
</div>

<div id="outline-container-orgf4729c4" class="outline-2">
<h2 id="orgf4729c4"><span class="section-number-2">15</span> UVA 12005 Bubble Sort</h2>
<div class="outline-text-2" id="text-15">
<p>
Assumamos sem perda de generalidade que estamos trabalhando com uma
permutação \(\pi\) de \(\{1,\dotsc,n\}\) tomada sob distribuição
uniforme (o problema garante que você pode assumir que os inteiros no
array são todos distintos, o que facilita).
Seja \(X\) a <a href="https://en.wikipedia.org/wiki/Random_variable">variável aleatória</a> que assume o número de inversões numa
dada permutação \(\pi\), i.e. o número de pares \((i,j)\) tais que
\(i < j\)
e \(\pi(i) > \pi(j)\). É óbvio que o que o problema pede, o número
esperado de trocas do <a href="https://en.wikipedia.org/wiki/Bubble_sort">Bubble Sort</a> para ordenar \(\pi\), é
\(\mathbb E(X)\), i.e. o <a href="https://en.wikipedia.org/wiki/Expected_value">valor esperado</a> de \(X\). Sendo
\(Y_{ij}\) a variável aleatória que assume o valor 1 se o par \((i,j)\) é
uma inversão, ou 0 caso contrário, temos obviamente que
</p>

\begin{equation*}
\mathbb E(X) = \mathbb E\biggl(\sum_{i}\sum_{j>i} Y_{ij}\biggr).
\end{equation*}

<p>
Da <a href="https://en.wikipedia.org/wiki/Expected_value#Linearity">linearidade da esperança</a>:
</p>

\begin{equation*}
\mathbb E(X) = \sum_{i}\sum_{j>i} \mathbb E(Y_{ij}).
\end{equation*}

<p>
Deixo como exercício você continuar as contas e fechar uma fórmula
\(O(1)\) em função de \(n\) para \(\mathbb E(X)\).
</p>

<ul class="org-ul">
<li>Complexidade: \(O(1)\) para o cálculo de \(E(X)\) (denominador e
numerador) \(+\) \(O(\log n)\) para o
Algoritmo de Euclides (para simplificar a fração).</li>
</ul>
</div>
</div>

<div id="outline-container-org40069eb" class="outline-2">
<h2 id="org40069eb"><span class="section-number-2">16</span> UVA 11048 Automatic Correction of Misspellings</h2>
<div class="outline-text-2" id="text-16">
<p>
Calouros, vocês têm totais condições para fazer este problema!
Este problema não requer nenhum conhecimento especial para ser
resolvido. Os mais experientes talvez tentariam aplicar a PD da
distância de edição aqui, mas definitivamente não é necessário.
</p>

<p>
Note que tanto o número de palavras no dicionário quanto o número de
consultas é pequeno neste problema, assim como o tamanho das palavras
envolvidas na brincadeira. Então, não precisam ser tão preciosistas
em relação à complexidade da solução. A solução que eu apresento a
seguir é a mais simples possível. Soluções mais eficientes existem,
mas esta aqui já passa (e tranquilamente!).
</p>

<p>
Para cada <i>query</i> \(s\), simplesmente itere sobre todas as palavras \(w\) do
dicionário. Se \(s=w\) (pode usar a <code>strcmp()</code> da <code>string.h</code>),
aborte o laço (\(s\) is correct). Se você
conseguiu identificar que \(s\) é <i>misspelling</i> de \(w\) (já vou explicar
como fazer isso), memorize isso, mas não aborte o laço (pois pode ser
que \(s\) seja igual a um outro \(w\) mais pra frente).
</p>

<p>
Implementar a função que verifica se uma palavra \(s_1\) é uma
<i>misspelling</i> de uma palavra \(s_2\) pode ser um pouco complicado para
iniciantes. É bem possível que você até consiga fazer o serviço, mas
que seu código fique bem complicado. Nestas horas, pensar em recursão
pode ajudar. A seguir apresento a minha função, que recebe duas
strings \(s_1\)
e \(s_2\), de tamanhos respectivamente \(t_1\) e \(t_2\),
e verifica se a string definida a partir da
posição \(i\) de \(s_1\) é uma <i>misspelling</i> da string definida a partir da
posição \(j\) de \(s_2\). Na hora de chamar, é só fazer:
</p>

<div class="org-src-container">
<pre><code class="src src-cpp"><span style="color: #00bfff;">if</span> (misspelling(str, 0, strlen(str), word[i], 0, strlen(word[i]) <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">...</span>
</code></pre>
</div>

<p>
Por favor, tente você desenvolver sua própria função. Olhe meu código
só quando você já conseguir ter feito o seu, para ver como você
poderia ter feito diferente. Tente também desenvolver um código
iterativo (que no fim das contas não vai ser muito diferente do
recursivo).
</p>

<div class="org-src-container">
<pre><code class="src src-cpp"><span style="color: #98f5ff;">int</span> <span style="color: #daa520;">misspelling</span>(<span style="color: #98f5ff;">char</span> *<span style="color: #4eee94;">s1</span>, <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">i</span>, <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">t1</span>, <span style="color: #98f5ff;">char</span> *<span style="color: #4eee94;">s2</span>, <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">j</span>, <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">t2</span>) {
  <span style="color: #00bfff;">if</span> (i == t1) <span style="color: #00bfff;">return</span> j == t2 - 1;
  <span style="color: #00bfff;">if</span> (j == t2) <span style="color: #00bfff;">return</span> i == t1 - 1;
  <span style="color: #00bfff;">return</span> !strcmp(s1 + i + 1, s2 + j) || !strcmp(s1 + i, s2 + j + 1) ||
    (s1[i] != s2[j] &amp;&amp; !strcmp(s1 + i + 1, s2 + j + 1)) ||
    (s1[i] != s2[j] &amp;&amp; s1[i] == s2[j + 1] &amp;&amp; s1[i + 1] == s2[j] &amp;&amp;
     !strcmp(s1 + i + 2, s2 + j + 2)) || <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">sem perigo de seg fault :)</span>
    (s1[i] == s2[j] &amp;&amp; misspelling(s1, i + 1, t1, s2, j + 1, t2));
}
</code></pre>
</div>

<ul class="org-ul">
<li>Complexidade: \(O(nm\times 25^2)\); o \(25^2\) se deve ao custo
\(O(t_1t_2)\) da minha função <code>misspelling()</code></li>
</ul>
</div>
</div>

<div id="outline-container-org720398d" class="outline-2">
<h2 id="org720398d"><span class="section-number-2">17</span> UVA 10739 String to Palindrome</h2>
<div class="outline-text-2" id="text-17">
<p>
Este problema é muito fácil se você já conhece PD e
<a href="https://en.wikipedia.org/wiki/Levenshtein_distance">distância de edição</a> (e o clássico algoritmo de
<a href="https://en.wikipedia.org/wiki/Needleman%E2%80%93Wunsch_algorithm">Needleman-Wunsch</a>).
Basta lembrar que um palíndromo é uma palavra
igual ao seu reverso. Então, é evidente que
a distância de edição de uma
palavra até seu reverso seja o dobro da menor distância de edição
desta palavra para algum palíndromo.
</p>

<ul class="org-ul">
<li>Complexidade: \(O(1000^2)\), já que 1000 é o comprimento máximo de uma
palavra da entrada.</li>
</ul>
</div>
</div>

<div id="outline-container-org3432c15" class="outline-2">
<h2 id="org3432c15"><span class="section-number-2">18</span> UVA 10192 Vacation</h2>
<div class="outline-text-2" id="text-18">
<p>
Leia a Seção 6.5.2 (Longest Common Subsequence, LCS &#x2014; não confundir com
Longest Common Substring, que também é abreviado LCS) do livro dos
Halim, que reduz o problema ao problema de <a href="https://en.wikipedia.org/wiki/Levenshtein_distance">distância de edição</a> (e,
portanto, que pode ser resolvido com o clássico algoritmo de
<a href="https://en.wikipedia.org/wiki/Needleman%E2%80%93Wunsch_algorithm">Needleman-Wunsch</a>).
</p>
</div>
</div>
