dicas.html

<div id="outline-container-org390066f" class="outline-2">
<h2 id="org390066f"><span class="section-number-2">19</span> UVA 11258 String Partition</h2>
<div class="outline-text-2" id="text-19">
<p>
Se você nunca estudou PD, estude (comece pelas seções respectivas nos
livros do Cormen, do Skiena e dos Halim). Após estudar, com certeza
você vai conseguir resolver este problema com PD sem maiores
dificuldades. Dica: perceba que tudo gira em torno das escolhas entre
particionar o número a partir de uma posição e não particionar ;)
</p>

<ul class="org-ul">
<li>Complexidade: \(O(m^2)\) para cada caso de teste, sendo \(m\) o número de
dígitos do inteiro fornecido naquele caso de teste.</li>
</ul>
</div>
</div>

<div id="outline-container-org61042a4" class="outline-2">
<h2 id="org61042a4"><span class="section-number-2">20</span> UVA 10891 Game of Sum</h2>
<div class="outline-text-2" id="text-20">
<blockquote>
<p>
<i>Dicas escritas por Alesom Zorzi.</i>
</p>
</blockquote>

<p>
É bem claro que é uma PD, o próprio exemplo explica isso. Tentei fazer
alternando os turnos, mas na realidade da para perceber que não importa
em qual turno estamos, já que ambos os jogadores querem tomar o máximo
possível. A diferença é que \(S[i][j]\) guarda o valor apenas do Player
1 já
que o esse valor é possível facilmente obter o valor do player 2 para
fazer a subtração. Um esboço da PD:
</p>

<div class="org-src-container">
<pre><code class="src src-cpp">pd(x, y)
  <span style="color: #00bfff;">if</span> (x==y) <span style="color: #00bfff;">return</span> valor[x];
  <span style="color: #00bfff;">for</span> (i =x; i &lt; y;i++)
    resp = max(resp, <span style="color: #98f5ff;">tomar</span> <span style="color: #4eee94;">i</span> - x + 1 elementos da esquerda para a direita);
  <span style="color: #00bfff;">for</span> (i = y; i &gt; x;i--)
    resp = max(resp, <span style="color: #98f5ff;">tomar</span> <span style="color: #4eee94;">y</span> - i +1 elementos da direita para a esquerda);
  resp = max(resp, <span style="color: #98f5ff;">tomar</span> todos os elementos de x <span style="color: #98f5ff;">at&#233;</span> <span style="color: #4eee94;">y</span>);
  <span style="color: #00bfff;">return</span> S[i][j] = resp;
</code></pre>
</div>

<ul class="org-ul">
<li>Complexidade: \(O(N^3)\), já que são \(N^2/2\) estados e a computação de
cada estado requer tempo \(O(N)\).</li>
</ul>
</div>
</div>

<div id="outline-container-org75377a0" class="outline-2">
<h2 id="org75377a0"><span class="section-number-2">21</span> UVA 11610 Reverse Prime</h2>
<div class="outline-text-2" id="text-21">
<blockquote>
<p>
<i>Dicas escritas por Matheus Dall Rosa.</i>
</p>
</blockquote>

<p>
  Primeiro calculamos todos os primos até \(10^6\) com o crivo de
  Eratóstenes, e então para computar os primos
reversos podemos verificar se o reverso de cada inteiro no intervalo
\([10^6,10^7]\) é um número primo menor que
\(10^6\).
</p>

<p>
Para respondermos a operação <i>query</i> podemos utilizar uma BIT e para
calcular a soma acumulada dos fatores
primos de todos os primos reversos em \(O(\log(N))\)
onde \(N\) é a quantidade de primos reversos.
</p>

<p>
Para processarmos a operação <i>deletion</i> devemos remover o número de
fatores primos deste primo reverso da
BIT.
</p>

<p>
Também devemos removê-lo da lista de primos reversos, podemos fazer
está operação em \(O(N)\), visto que o
número de operações do tipo <i>deletion</i> é no máximo 3500 e como o número de
primos reversos no intervalo dado é
aproximadamente 79000 então temos: \(3500*79000 = 276500000\), um algoritmo
com esta complexidade provavelmente não passaria se o problema
tivesse multiplos casos de teste porém o problema em questão só
possui um caso de teste.
</p>

<ul class="org-ul">
<li>Complexidade: Assim teremos \(O(Q*log(N))\) para responder as
operações do tipo <i>query</i> e \(O(D*N)\) para responder todas as
operações do tipo <i>deletion</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-org368ad36" class="outline-2">
<h2 id="org368ad36"><span class="section-number-2">22</span> URI 1634 Another Lottery</h2>
<div class="outline-text-2" id="text-22">
<blockquote>
<p>
<i>Dicas escritas por Leonardo Blanger.</i>
</p>
</blockquote>

<p>
A chave do problema é perceber que, devido ao prêmio dobrar a cada
round, o prêmio no último round vai ser maior do que a soma de todos os
anteriores. Portanto, o proplema se resume a encontrar a probabilidade
de cada apostador vencer o último round, que é dada pela quantidade de
bilhetes comprado pelo apostador no último round, dividido pelo total de
bilhetes vendidos no último round. (Lembrando que a resposta precisa ser
uma fração simplificada).
</p>

<ul class="org-ul">
<li>Complexidade: \(O(n)\)</li>
</ul>
</div>
</div>

<div id="outline-container-org663da0b" class="outline-2">
<h2 id="org663da0b"><span class="section-number-2">23</span> URI 2014 Blood Groups</h2>
<div class="outline-text-2" id="text-23">
<blockquote>
<p>
<i>Dicas escritas por Alesom Zorzi.</i>
</p>
</blockquote>

<p>
Este problema é bem confuso, demorei mesmo para entender o que ele
pedia. Mas depois de ler algumas vezes e montar os casos com muuuita
calma, percebi que ele quer apenas verificar se existe um emparelhamento
perfeito em um grafo-bipartido (vide
<a href="http://moreno.cin.ufpe.br/~if775/2013.1/ppt/Emparelhamento%20emGrafosBipartidos.pdf">aqui</a>). Para o emparelhamento máximo no grafo bipartido, eu usei o
algoritmo de Hopcroft-Karp que é um algoritmo mais eficiente para
encontrar o emparelhamento máximo em grafos bipartidos (quando comparado
aos métodos mais simples). Mas como ônus é mais complicado também, o
algoritmo pode ser encontrado
<a href="http://moreno.cin.ufpe.br/~if775/2013.1/ppt/Emparelhamento%20emGrafosBipartidos.pdf">aqui</a> e na Seção 9.10 do livro dos Halim.
</p>

<p>
Forme o grafo \(G\), com \(V(G) = A\cup B\) da seguinte forma:
A partição \(A\) do grafo terá \(N\)
 vértices e cada vértice será um dos pais;
A partição \(B\) também terá \(N\)
 vértices, mas estes vértices serão os \(N\)
 alelos do possível tipo sanguíneo.
</p>

<p>
Vai ter aresta \(uv\) com \(u \in A\) e \(v \in B\) se \(u\) pode doar o alelo
\(v\).
</p>

<p>
Depois é só verificar o emparelhamento máximo no grafo \(G\)
 e ver se o tamanho desse emparelhamento é igual a \(N\).
</p>

<ul class="org-ul">
<li>Complexidade: A complexidade do algoritmo fica:
\(O(Q*(N^2+|E|\sqrt{|V|}))=O(Q*N^2\sqrt N)\), já que \(|V|=O(N)\) e
\(|E|=O(N^2)\).</li>
</ul>
</div>
</div>

<div id="outline-container-org7eb0f35" class="outline-2">
<h2 id="org7eb0f35"><span class="section-number-2">24</span> URI 1671 Code</h2>
<div class="outline-text-2" id="text-24">
<p>
Sendo \(G\) o grafo definido no próprio enunciado do problema, perceba que
qualquer <a href="https://en.wikipedia.org/wiki/Eulerian_trail">trilha euleriana</a> em \(G\) define exatamente o que o problema pede
como resposta. Para computar uma trilha euleriana num grafo, existem
vários algoritmos, sendo o mais eficiente o Algoritmo de Hierholzer, que
pode ser implementado com listas duplamente encadeadas em tempo linear
no tamanho do grafo.
 O livro dos Halim (3<sup>a</sup> edição)
 apresenta no início da página 180
 uma implementação quadrática no tamanho do grafo
para o Algoritmo de Hierholzer.
Neste problema em particular, você não precisa construir o grafo
explicitamente, e implementar o Algoritmo de Hierholzer pode ficar até
mais fácil assim.
</p>

<ul class="org-ul">
<li>Complexidade: utilizando uma implementação linear para o Algoritmo de
Hierholzer:
\(O(\lvert V\rvert+\lvert E\rvert) = O(10^{n-1}+10\times
  10^{n-1})=O(10^n)\), o que é factível, já que \(n\leq 6\); utilizando
um <code>set</code> para lembrar quais arestas já foram visitadas:
\(O((\lvert V\rvert+\lvert E\rvert)\log\lvert E\rvert) = O(n\times
  10^n)\).</li>
</ul>
</div>
</div>

<div id="outline-container-org0165a2b" class="outline-2">
<h2 id="org0165a2b"><span class="section-number-2">25</span> URI 1748 Fence the Vegetables</h2>
<div class="outline-text-2" id="text-25">
<p>
Este foi o Problema F da Nacional de 2014. Veja a discussão
sobre ele <a href="http://codeforces.com/blog/entry/14650">neste link</a>.
</p>
</div>
</div>
