dicas.org
* URI 2007 Fence the Vegetables Fail

  #+BEGIN_QUOTE
  /Dicas escritas por Alesom Zorzi./
  #+END_QUOTE

  Esse problema é difícil, de 0 a 10 eu daria um 8. Tem muitos truques
  de implementação que é difícil se ater na hora da competição. Apesar
  do problema parecer de Geometria (verificar se um ponto esta dentro de
  um polígono, não necessariamente convexo) os limites de entrada são
  realmente muito grandes $10^5$ vértices e $10^5$ pontos. Então é
  necessário pensar em outra abordagem: O que facilita é o fato de todas
  as arestas serem paralelas aos eixos. Assim podemos usar uma técnica
  de Line Sweep (vide [[https://www.topcoder.com/community/data-science/data-science-tutorials/line-sweep-algorithms/][aqui]] e [[https://en.wikipedia.org/wiki/Sweep_line_algorithm][aqui]]).

  Assim, a abordagem que eu usei foi:
  Primeiro, podemos notar que basta olhar para as arestas do polígono que
  são paralelas ao eixo $x$. Armazene então todas as arestas paralelas ao
  eixo dos $x$ (note que isso implica que todos os vértices do polígono
  serão armazenados).

  Agora passe uma "linha" por todos os pontos (incluindo os vértices do
  polígono) em ordem de $x$. Então teremos três casos: A linha encosta
  em um
  vértice que é inicio de uma aresta; A linha encosta em um vértice que é
  final de uma aresta; A linha encosta em um ponto $p$.
  Se o primeiro caso
  acontecer, devemos adicionar a aresta em um conjunto de arestas $S$ que
  estão ativas. Se o segundo caso acontecer devemos remover a aresta de
  $S$. Se o terceiro caso acontecer devemos verificar entre quais arestas
  está o ponto $p$ e contar ou não esse ponto para a resposta. Mas a
  realidade é que apenas precisamos saber quantas arestas ativas existem
  antes (ou depois) do ponto. Se existe um número par de arestas antes
  dele quer dizer que ele está fora do polígono, se não esta dentro do
  polígono.

  Note que precisamos realizar as atualizações, remoções e consultas de
  forma bastante eficaz (não pode ser linear, já estamos usando tempo
  linear para o line sweep, ficaria $10^5 * 10^5 + 10 ^5 / 2$ no pior
  dos casos), então vamos recorrer a boa e velha BIT (ou Fenwick tree)
  (vide [[https://en.wikipedia.org/wiki/Fenwick_tree][aqui]] e [[https://www.topcoder.com/community/data-science/data-science-tutorials/binary-indexed-trees/][aqui]]). Assim, a cada vez que inserirmos alguma aresta a
  no conjunto $S$ iremos dar um update na BIT no lugar onde esta o valor
  que representa a aresta $a$ em $S$. Para pesquisar, apenas verificamos
  quantas arestas existem antes do ponto p com uma quer y na BIT.

  Lindo né? Não. Já que os valores de $x$ e $y$ podem ir de $-10^9$ até
  $10^9$. Mas como o número de pontos e vértices somados tem no máximo
  tamanho de $2*10^5$ podemos usar uma "compactação" para o $y$ de todos
  os elementos (vértices e pontos). Apenas ordene por ordem de $y$ as
  arestas e os pontos. Percorra o vetor e dê valores de 1 até $N$, sendo
  $N$
  o número total de elementos no vetor. Agora sim podemos usar a BIT
  para fazer as atualizações e consultas.

  - Complexidade $N\log(N) = 10^5*log(10^5)$.

* URI 2012 Height Map

  Este foi o Problema H da Nacional de 2015. Veja a discussão
  sobre ele [[https://chococontest.wordpress.com/2015/11/23/solucionario-regional-south-america-2015/][neste link]].

* URI 1752 Journey Through The Kingdom

  Este foi o Problema J da Nacional de 2014. Veja a discussão
  sobre ele [[http://codeforces.com/blog/entry/14650][neste link]].

* URI 2009 Just a bit sorted

  Este foi o Problema J da Nacional de 2015. Veja a discussão
  sobre ele [[https://chococontest.wordpress.com/2015/11/23/solucionario-regional-south-america-2015/][neste link]].

* URI 2030 Pit Stop

  Problema /ad hoc/ fácil ;)

* URI 2031 Rock, Paper, Airstrike

  Problema /ad hoc/ muito fácil ;)

* UVA 13049 Combination Lock

  #+BEGIN_QUOTE
  /Dicas escritas por Kétly Machado./
  #+END_QUOTE

Para solucionar este problema, basta olharmos para cada combinação
~Initial~ e ~Target~ e computarmos a resposta da seguinte forma:

  #+BEGIN_SRC cpp
  resposta = 0
  Para todo i de 0 até n faça
    resposta = resposta + min(número de movimentos para se alcançar Target[i] a partir de Inicial[i] girando no sentido horário,
                              número de movimentos para se alcançar Target[i] a partir de Inicial[i] girando no sentido anti-horário)
  #+END_SRC

- Complexidade: $O(n)$

* UVA 11094 Continents

  Dicas podem ser encontradas na página 137 do livro dos Halim (3^a
  edição).

* UVA 11357 Ensuring Truth

  #+BEGIN_QUOTE
  /Dicas escritas por Alesom Zorzi./
  #+END_QUOTE

  Este é um problema simples, dado uma expressão booleana na [[https://en.wikipedia.org/wiki/Disjunctive_normal_form][DNF]], você
precisa dizer se existe um conjunto de valores binários
 $v_1, v_2, \dotsc,v_n$
 que, quando aplicado às variáveis $va_1, va_2, \dotsc, va_n $ da
expressão booleana que é dada na entrada, faz com que tal expressão
tenha como valor final Verdadeiro (ou 1, ou true, entenda como quiser),
ou seja, dizer se a expressão é satisfatível.

Como a forma normal é na DNF, sabemos que apenas uma das cláusulas
precisa ser verdadeira, e para uma clausula ser verdadeira é necessário
que todos as suas variáveis tenham valores positivos, ou seja, a
variável  $va_1$ precisa receber um valor 1 (ou verdadeiro), já a
variável ${\sim}va_1$ precisa receber um valor 0 (ou falso). Ou seja, é um
problema guloso (/greedy/), o que significa que podemos sempre
escolher o melhor
localmente e isto conduzirá à melhor escolha do todo.

Então, o que precisamos fazer é testar para toda cláusula se
é possível
atribuir valores às variáveis de forma que não haja conflitos entre a
valoração das variáveis. Se em uma cláusula isso é possível, então, a
resposta é ~YES~. Se em nenhuma das clausulas isso é possível, então, a
resposta é ~NO~.

- Complexidade: $O(n)$, sendo $n$ o número de caracteres lidos na entrada.

P.S.: Uma dica para a leitura da entrada é: Guarde as cláusulas
separadas, em vetores de pares por exemplo, onde o par é
~variável/valorNecessário~. ~valorNecessário~ é 1 se a variável
 não tiver um
sinal de $\sim$
 no caractere anterior e 0 se tiver. Quando ler um '~(~', inicie
um novo vetor de pares ~variável/valorNecessário~ e só termine o vetor
quando ler um '~)~'. Deste modo fica mais fácil de verificar se existe
conflito entre duas variáveis na mesma clausula.

