dicas.html

<div id="outline-container-org7cc1590" class="outline-2">
<h2 id="org7cc1590"><span class="section-number-2">26</span> URI 2007 Fence the Vegetables Fail</h2>
<div class="outline-text-2" id="text-26">
<blockquote>
<p>
<i>Dicas escritas por Alesom Zorzi.</i>
</p>
</blockquote>

<p>
Esse problema é difícil, de 0 a 10 eu daria um 8. Tem muitos truques
de implementação que é difícil se ater na hora da competição. Apesar
do problema parecer de Geometria (verificar se um ponto esta dentro de
um polígono, não necessariamente convexo) os limites de entrada são
realmente muito grandes \(10^5\) vértices e \(10^5\) pontos. Então é
necessário pensar em outra abordagem: O que facilita é o fato de todas
as arestas serem paralelas aos eixos. Assim podemos usar uma técnica
de Line Sweep (vide <a href="https://www.topcoder.com/community/data-science/data-science-tutorials/line-sweep-algorithms/">aqui</a> e <a href="https://en.wikipedia.org/wiki/Sweep_line_algorithm">aqui</a>).
</p>

<p>
Assim, a abordagem que eu usei foi:
Primeiro, podemos notar que basta olhar para as arestas do polígono que
são paralelas ao eixo \(x\). Armazene então todas as arestas paralelas ao
eixo dos \(x\) (note que isso implica que todos os vértices do polígono
serão armazenados).
</p>

<p>
Agora passe uma "linha" por todos os pontos (incluindo os vértices do
polígono) em ordem de \(x\). Então teremos três casos: A linha encosta
em um
vértice que é inicio de uma aresta; A linha encosta em um vértice que é
final de uma aresta; A linha encosta em um ponto \(p\).
Se o primeiro caso
acontecer, devemos adicionar a aresta em um conjunto de arestas \(S\) que
estão ativas. Se o segundo caso acontecer devemos remover a aresta de
\(S\). Se o terceiro caso acontecer devemos verificar entre quais arestas
está o ponto \(p\) e contar ou não esse ponto para a resposta. Mas a
realidade é que apenas precisamos saber quantas arestas ativas existem
antes (ou depois) do ponto. Se existe um número par de arestas antes
dele quer dizer que ele está fora do polígono, se não esta dentro do
polígono.
</p>

<p>
Note que precisamos realizar as atualizações, remoções e consultas de
forma bastante eficaz (não pode ser linear, já estamos usando tempo
linear para o line sweep, ficaria \(10^5 * 10^5 + 10 ^5 / 2\) no pior
dos casos), então vamos recorrer a boa e velha BIT (ou Fenwick tree)
(vide <a href="https://en.wikipedia.org/wiki/Fenwick_tree">aqui</a> e <a href="https://www.topcoder.com/community/data-science/data-science-tutorials/binary-indexed-trees/">aqui</a>). Assim, a cada vez que inserirmos alguma aresta a
no conjunto \(S\) iremos dar um update na BIT no lugar onde esta o valor
que representa a aresta \(a\) em \(S\). Para pesquisar, apenas verificamos
quantas arestas existem antes do ponto p com uma quer y na BIT.
</p>

<p>
Lindo né? Não. Já que os valores de \(x\) e \(y\) podem ir de \(-10^9\) até
\(10^9\). Mas como o número de pontos e vértices somados tem no máximo
tamanho de \(2*10^5\) podemos usar uma "compactação" para o \(y\) de todos
os elementos (vértices e pontos). Apenas ordene por ordem de \(y\) as
arestas e os pontos. Percorra o vetor e dê valores de 1 até \(N\), sendo
\(N\)
o número total de elementos no vetor. Agora sim podemos usar a BIT
para fazer as atualizações e consultas.
</p>

<ul class="org-ul">
<li>Complexidade \(N\log(N) = 10^5*log(10^5)\).</li>
</ul>
</div>
</div>

<div id="outline-container-org12a9622" class="outline-2">
<h2 id="org12a9622"><span class="section-number-2">27</span> URI 2012 Height Map</h2>
<div class="outline-text-2" id="text-27">
<p>
Este foi o Problema H da Nacional de 2015. Veja a discussão
sobre ele <a href="https://chococontest.wordpress.com/2015/11/23/solucionario-regional-south-america-2015/">neste link</a>.
</p>
</div>
</div>

<div id="outline-container-orgc5f71fa" class="outline-2">
<h2 id="orgc5f71fa"><span class="section-number-2">28</span> URI 1752 Journey Through The Kingdom</h2>
<div class="outline-text-2" id="text-28">
<p>
Este foi o Problema J da Nacional de 2014. Veja a discussão
sobre ele <a href="http://codeforces.com/blog/entry/14650">neste link</a>.
</p>
</div>
</div>

<div id="outline-container-org9e8018e" class="outline-2">
<h2 id="org9e8018e"><span class="section-number-2">29</span> URI 2009 Just a bit sorted</h2>
<div class="outline-text-2" id="text-29">
<p>
Este foi o Problema J da Nacional de 2015. Veja a discussão
sobre ele <a href="https://chococontest.wordpress.com/2015/11/23/solucionario-regional-south-america-2015/">neste link</a>.
</p>
</div>
</div>

<div id="outline-container-org99dddec" class="outline-2">
<h2 id="org99dddec"><span class="section-number-2">30</span> URI 2030 Pit Stop</h2>
<div class="outline-text-2" id="text-30">
<p>
Problema <i>ad hoc</i> fácil ;)
</p>
</div>
</div>

<div id="outline-container-org8460712" class="outline-2">
<h2 id="org8460712"><span class="section-number-2">31</span> URI 2031 Rock, Paper, Airstrike</h2>
<div class="outline-text-2" id="text-31">
<p>
Problema <i>ad hoc</i> muito fácil ;)
</p>
</div>
</div>

<div id="outline-container-orgcc34cc8" class="outline-2">
<h2 id="orgcc34cc8"><span class="section-number-2">32</span> UVA 13049 Combination Lock</h2>
<div class="outline-text-2" id="text-32">
<blockquote>
<p>
<i>Dicas escritas por Kétly Machado.</i>
</p>
</blockquote>

<p>
Para solucionar este problema, basta olharmos para cada combinação
<code>Initial</code> e <code>Target</code> e computarmos a resposta da seguinte forma:
</p>

<div class="org-src-container">
<pre><code class="src src-cpp">resposta = 0
Para todo i de 0 at&#233; n fa&#231;a
  resposta = resposta + min(n&#250;mero de movimentos para se <span style="color: #98f5ff;">alcan&#231;ar</span> <span style="color: #4eee94;">Target</span>[i] a partir de Inicial[i] girando no sentido hor&#225;rio,
                            n&#250;mero de movimentos para se <span style="color: #98f5ff;">alcan&#231;ar</span> <span style="color: #4eee94;">Target</span>[i] a partir de Inicial[i] girando no sentido anti-hor&#225;rio)
</code></pre>
</div>

<ul class="org-ul">
<li>Complexidade: \(O(n)\)</li>
</ul>
</div>
</div>

<div id="outline-container-org94ad572" class="outline-2">
<h2 id="org94ad572"><span class="section-number-2">33</span> UVA 11094 Continents</h2>
<div class="outline-text-2" id="text-33">
<p>
Dicas podem ser encontradas na página 137 do livro dos Halim (3<sup>a</sup>
edição).
</p>
</div>
</div>

<div id="outline-container-org55287c2" class="outline-2">
<h2 id="org55287c2"><span class="section-number-2">34</span> UVA 11357 Ensuring Truth</h2>
<div class="outline-text-2" id="text-34">
<blockquote>
<p>
<i>Dicas escritas por Alesom Zorzi.</i>
</p>
</blockquote>

<p>
  Este é um problema simples, dado uma expressão booleana na <a href="https://en.wikipedia.org/wiki/Disjunctive_normal_form">DNF</a>, você
precisa dizer se existe um conjunto de valores binários
 \(v_1, v_2, \dotsc,v_n\)
 que, quando aplicado às variáveis $va<sub>1</sub>, va<sub>2</sub>, \dotsc, va<sub>n</sub> $ da
expressão booleana que é dada na entrada, faz com que tal expressão
tenha como valor final Verdadeiro (ou 1, ou true, entenda como quiser),
ou seja, dizer se a expressão é satisfatível.
</p>

<p>
Como a forma normal é na DNF, sabemos que apenas uma das cláusulas
precisa ser verdadeira, e para uma clausula ser verdadeira é necessário
que todos as suas variáveis tenham valores positivos, ou seja, a
variável  \(va_1\) precisa receber um valor 1 (ou verdadeiro), já a
variável \({\sim}va_1\) precisa receber um valor 0 (ou falso). Ou seja, é um
problema guloso (<i>greedy</i>), o que significa que podemos sempre
escolher o melhor
localmente e isto conduzirá à melhor escolha do todo.
</p>

<p>
Então, o que precisamos fazer é testar para toda cláusula se
é possível
atribuir valores às variáveis de forma que não haja conflitos entre a
valoração das variáveis. Se em uma cláusula isso é possível, então, a
resposta é <code>YES</code>. Se em nenhuma das clausulas isso é possível, então, a
resposta é <code>NO</code>.
</p>

<ul class="org-ul">
<li>Complexidade: \(O(n)\), sendo \(n\) o número de caracteres lidos na entrada.</li>
</ul>

<p>
P.S.: Uma dica para a leitura da entrada é: Guarde as cláusulas
separadas, em vetores de pares por exemplo, onde o par é
<code>variável/valorNecessário</code>. <code>valorNecessário</code> é 1 se a variável
 não tiver um
sinal de \(\sim\)
 no caractere anterior e 0 se tiver. Quando ler um '<code>(</code>', inicie
um novo vetor de pares <code>variável/valorNecessário</code> e só termine o vetor
quando ler um '<code>)</code>'. Deste modo fica mais fácil de verificar se existe
conflito entre duas variáveis na mesma clausula.
</p>
</div>
</div>
