dicas.org
* UVA 11475 Extend to Palindromes

  #+BEGIN_QUOTE
  /Dicas escritas por Kétly Machado./
  #+END_QUOTE

Seja $S$ a string original dada na entrada, indexada de $0$ até
$tam(S) - 1$, para solucionar este problema precisamos encontrar a maior
substring $S'$ de $S$ que contenha $S[tam(S) - 1]$ e seja um
palíndromo. Encontrada $S'$, dada pelos caracteres $S[i]$ até
$S[tam(S) - 1]$, a resposta é dada pela concatenação de $S$ com a
substring $S''$ invertida, sendo $S''$ dada pelos caracteres $S[0]$ até
$S[i - 1]$ (se $i - 1 < 0$, então $S''$ é uma string vazia).

Para encontrar $S'$ é possível utilizar uma busca linear na string $S$,
testando para cada $S[i] = S[tam(S) - 1]$ se a substring dada pelos
caracteres $S[i]$ até $S[tam - 1]$ forma um palíndromo.

- Complexidade: Embora acredite que esta solução no pior caso tenha
  complexidade $O(n * (n + 1) / 2) = O(n^2)$ e, teoricamente não passe,
  já que $n <= 10^5$, a mesma foi suficiente para atender às entradas do
  UVA.

* UVA 622 Grammar Evaluation

  Dicas podem ser encontradas na página 239 do livro dos Halim (3^a
  edição).

* UVA 10859 Placing Lampposts

  Tente se inspirar na PD para o Problema de Cobertura Mínima por
  Vértices (/MVC: Minimum Vertex Cover/) _em árvores_, muito bem
  explicada nas páginas 175--176 do livro dos Halim (3^a edição).

* UVA 12542 Prime Substring

  Dicas podem ser encontradas na página 203 do livro dos Halim (3^a
  edição).

* UVA 13026 Search the Khoj

  #+BEGIN_QUOTE
  /Dicas escritas por Kétly Machado./
  #+END_QUOTE

Neste problema, para cada telefone presente na agenda do pai de Khoj, é
realizada a comparação com o telefone memorizado por Khoj, avaliando
para cada caractere $a$ do \(i\)-ésimo telefone da agenda e cada caractere
\(k\) do telefone memorizado por Khoj se $a = k$. Seja $f$ o número de
vezes em que a comparação é falsa, se $f \leq 1$ então o \(i\)-ésimo
telefone da agenda pode ser impresso na saída. Devemos realizar esse
procedimento para todo $i$ de $1$ até $n$.

- Complexidade: Seja $t$ o tamanho padrão dos telefones da agenda e do
  telefone memorizado por Khoj, temos uma complexidade de $O(nt)$, como $n
  \leq 10^3$ e $t \leq 11$, temos uma complexidade da ordem de $10^4$, que
  passa tranquilamente.

* UVA 11319 Stupid Sequence?

  Dicas podem ser encontradas na página 348 do livro dos Halim (3^a
  edição).

* UVA 488 Triangle Wave

  Dicas podem ser encontradas na página 239 do livro dos Halim (3^a
  edição).

* LA 5057 Worst Location

  Este foi o problema A da Regional de Jakarta 2010. Dicas podem ser
  encontradas [[http://www.suhendry.net/blog/?p=1389][aqui]].

* LA 5058 Counting BST

  #+BEGIN_QUOTE
  /Dicas escritas por Leonardo Blanger./
  #+END_QUOTE

  Problema bem legal de combinatória. Existem
  $\binom M N =\frac{M!}{(M-N)!N!}$
  subconjuntos de valores que podem ser
  escolhidos. Suponha que tenhamos escolhidos um deles, então precisamos,
  para cada nó da árvore, recuperar a quantidade de valores na sub-árvore
  esquerda e na subárvore direita e encontrar de quantas formas podemos
  organizar estes valores, de forma que a ordem dos valores da subárvore
  esquerda e direita seja preservada. Podemos fazer isto recursivamente e
  com a ajuda de uma programação dinâmica. Ao final, basta multiplicar
  este valor por $\binom M N$ e temos a resposta.

- Complexidade: A complexidade de calcular a quantidade de ordens
  possíveis, dados a
  quantidade de valores na esquerda e na direita pode ser feita em
  $O(N)$, levando em conta todos os casos de teste. A contagem para cada
  nó é constante para cada nó. O cálculo das combinações
  pode ser feito em tempo constante se os
  fatoriais e seus inversos multiplicativos forem calculados antes dos
  casos de teste.

* LA 5059 Playing With Stones

  Este foi o problema C da Regional de Jakarta 2010. Dicas podem ser
  encontradas [[http://www.suhendry.net/blog/?p=1389][aqui]].

* LA 5060 Arm Wrestling Tournament

  Este foi o problema D da Regional de Jakarta 2010. Dicas podem ser
  encontradas [[http://www.suhendry.net/blog/?p=1389][aqui]].

* LA 5061 Lightning Energy Report

  Este foi o problema E da Regional de Jakarta 2010. Dicas podem ser
  encontradas [[http://www.suhendry.net/blog/?p=1389][aqui]].

* LA 5062 Transitive Closure

  Este foi o problema F da Regional de Jakarta 2010. Dicas podem ser
  encontradas [[http://www.suhendry.net/blog/?p=1389][aqui]].

* LA 5063 Just Sum It

  Este foi o problema G da Regional de Jakarta 2010. Dicas podem ser
  encontradas [[http://www.suhendry.net/blog/?p=1389][aqui]].

* LA 5064 Serial Numbers

  Este foi o problema H da Regional de Jakarta 2010. Dicas podem ser
  encontradas [[http://www.suhendry.net/blog/?p=1389][aqui]].

* LA 5065 Romantic Date

  Este foi o problema I da Regional de Jakarta 2010. Dicas podem ser
  encontradas [[http://www.suhendry.net/blog/?p=1389][aqui]].

* LA 5066 Fire Drill

  #+BEGIN_QUOTE
  /Dicas escritas por Leonardo Blanger./
  #+END_QUOTE

  Este problema pode ser resolvido com uma combinação de uma busca em
  largura (BFS) para calcular a distância das células até a saída e de
  uma programação dinâmica para decidir quais voluntários
  escolher. Quando um voluntário for escolhido é preciso ir até ele e
  carregá-lo de volta, portanto, custo de escolher um voluntário é 3
  vezes a distância dele até a saída.

  - Complexidade: A busca possui complexidade linear, enquanto a PD é
    $O(NS)$.

