dicas.html

<div id="outline-container-orgf05c5ed" class="outline-2">
<h2 id="orgf05c5ed"><span class="section-number-2">35</span> UVA 11475 Extend to Palindromes</h2>
<div class="outline-text-2" id="text-35">
<blockquote>
<p>
<i>Dicas escritas por Kétly Machado.</i>
</p>
</blockquote>

<p>
Seja \(S\) a string original dada na entrada, indexada de \(0\) até
\(tam(S) - 1\), para solucionar este problema precisamos encontrar a maior
substring \(S'\) de \(S\) que contenha \(S[tam(S) - 1]\) e seja um
palíndromo. Encontrada \(S'\), dada pelos caracteres \(S[i]\) até
\(S[tam(S) - 1]\), a resposta é dada pela concatenação de \(S\) com a
substring \(S''\) invertida, sendo \(S''\) dada pelos caracteres \(S[0]\) até
\(S[i - 1]\) (se \(i - 1 < 0\), então \(S''\) é uma string vazia).
</p>

<p>
Para encontrar \(S'\) é possível utilizar uma busca linear na string \(S\),
testando para cada \(S[i] = S[tam(S) - 1]\) se a substring dada pelos
caracteres \(S[i]\) até \(S[tam - 1]\) forma um palíndromo.
</p>

<ul class="org-ul">
<li>Complexidade: Embora acredite que esta solução no pior caso tenha
complexidade \(O(n * (n + 1) / 2) = O(n^2)\) e, teoricamente não passe,
já que \(n <= 10^5\), a mesma foi suficiente para atender às entradas do
UVA.</li>
</ul>
</div>
</div>

<div id="outline-container-orga251fab" class="outline-2">
<h2 id="orga251fab"><span class="section-number-2">36</span> UVA 622 Grammar Evaluation</h2>
<div class="outline-text-2" id="text-36">
<p>
Dicas podem ser encontradas na página 239 do livro dos Halim (3<sup>a</sup>
edição).
</p>
</div>
</div>

<div id="outline-container-orgcf45068" class="outline-2">
<h2 id="orgcf45068"><span class="section-number-2">37</span> UVA 10859 Placing Lampposts</h2>
<div class="outline-text-2" id="text-37">
<p>
Tente se inspirar na PD para o Problema de Cobertura Mínima por
Vértices (<i>MVC: Minimum Vertex Cover</i>) <span class="underline">em árvores</span>, muito bem
explicada nas páginas 175&#x2013;176 do livro dos Halim (3<sup>a</sup> edição).
</p>
</div>
</div>

<div id="outline-container-org5020c01" class="outline-2">
<h2 id="org5020c01"><span class="section-number-2">38</span> UVA 12542 Prime Substring</h2>
<div class="outline-text-2" id="text-38">
<p>
Dicas podem ser encontradas na página 203 do livro dos Halim (3<sup>a</sup>
edição).
</p>
</div>
</div>

<div id="outline-container-org836127a" class="outline-2">
<h2 id="org836127a"><span class="section-number-2">39</span> UVA 13026 Search the Khoj</h2>
<div class="outline-text-2" id="text-39">
<blockquote>
<p>
<i>Dicas escritas por Kétly Machado.</i>
</p>
</blockquote>

<p>
Neste problema, para cada telefone presente na agenda do pai de Khoj, é
realizada a comparação com o telefone memorizado por Khoj, avaliando
para cada caractere \(a\) do \(i\)-ésimo telefone da agenda e cada caractere
\(k\) do telefone memorizado por Khoj se \(a = k\). Seja \(f\) o número de
vezes em que a comparação é falsa, se \(f \leq 1\) então o \(i\)-ésimo
telefone da agenda pode ser impresso na saída. Devemos realizar esse
procedimento para todo \(i\) de \(1\) até \(n\).
</p>

<ul class="org-ul">
<li>Complexidade: Seja \(t\) o tamanho padrão dos telefones da agenda e do
telefone memorizado por Khoj, temos uma complexidade de \(O(nt)\), como \(n
  \leq 10^3\) e \(t \leq 11\), temos uma complexidade da ordem de \(10^4\), que
passa tranquilamente.</li>
</ul>
</div>
</div>

<div id="outline-container-org1b7b422" class="outline-2">
<h2 id="org1b7b422"><span class="section-number-2">40</span> UVA 11319 Stupid Sequence?</h2>
<div class="outline-text-2" id="text-40">
<p>
Dicas podem ser encontradas na página 348 do livro dos Halim (3<sup>a</sup>
edição).
</p>
</div>
</div>

<div id="outline-container-org49cb24d" class="outline-2">
<h2 id="org49cb24d"><span class="section-number-2">41</span> UVA 488 Triangle Wave</h2>
<div class="outline-text-2" id="text-41">
<p>
Dicas podem ser encontradas na página 239 do livro dos Halim (3<sup>a</sup>
edição).
</p>
</div>
</div>

<div id="outline-container-orgba62cd5" class="outline-2">
<h2 id="orgba62cd5"><span class="section-number-2">42</span> LA 5057 Worst Location</h2>
<div class="outline-text-2" id="text-42">
<p>
Este foi o problema A da Regional de Jakarta 2010. Dicas podem ser
encontradas <a href="http://www.suhendry.net/blog/?p=1389">aqui</a>.
</p>
</div>
</div>

<div id="outline-container-org3740aed" class="outline-2">
<h2 id="org3740aed"><span class="section-number-2">43</span> LA 5058 Counting BST</h2>
<div class="outline-text-2" id="text-43">
<blockquote>
<p>
<i>Dicas escritas por Leonardo Blanger.</i>
</p>
</blockquote>

<p>
Problema bem legal de combinatória. Existem
\(\binom M N =\frac{M!}{(M-N)!N!}\)
subconjuntos de valores que podem ser
escolhidos. Suponha que tenhamos escolhidos um deles, então precisamos,
para cada nó da árvore, recuperar a quantidade de valores na sub-árvore
esquerda e na subárvore direita e encontrar de quantas formas podemos
organizar estes valores, de forma que a ordem dos valores da subárvore
esquerda e direita seja preservada. Podemos fazer isto recursivamente e
com a ajuda de uma programação dinâmica. Ao final, basta multiplicar
este valor por \(\binom M N\) e temos a resposta.
</p>

<ul class="org-ul">
<li>Complexidade: A complexidade de calcular a quantidade de ordens
possíveis, dados a
quantidade de valores na esquerda e na direita pode ser feita em
\(O(N)\), levando em conta todos os casos de teste. A contagem para cada
nó é constante para cada nó. O cálculo das combinações
pode ser feito em tempo constante se os
fatoriais e seus inversos multiplicativos forem calculados antes dos
casos de teste.</li>
</ul>
</div>
</div>

<div id="outline-container-orge7e2915" class="outline-2">
<h2 id="orge7e2915"><span class="section-number-2">44</span> LA 5059 Playing With Stones</h2>
<div class="outline-text-2" id="text-44">
<p>
Este foi o problema C da Regional de Jakarta 2010. Dicas podem ser
encontradas <a href="http://www.suhendry.net/blog/?p=1389">aqui</a>.
</p>
</div>
</div>

<div id="outline-container-orge23c355" class="outline-2">
<h2 id="orge23c355"><span class="section-number-2">45</span> LA 5060 Arm Wrestling Tournament</h2>
<div class="outline-text-2" id="text-45">
<p>
Este foi o problema D da Regional de Jakarta 2010. Dicas podem ser
encontradas <a href="http://www.suhendry.net/blog/?p=1389">aqui</a>.
</p>
</div>
</div>

<div id="outline-container-org7c32c03" class="outline-2">
<h2 id="org7c32c03"><span class="section-number-2">46</span> LA 5061 Lightning Energy Report</h2>
<div class="outline-text-2" id="text-46">
<p>
Este foi o problema E da Regional de Jakarta 2010. Dicas podem ser
encontradas <a href="http://www.suhendry.net/blog/?p=1389">aqui</a>.
</p>
</div>
</div>

<div id="outline-container-org94ef91e" class="outline-2">
<h2 id="org94ef91e"><span class="section-number-2">47</span> LA 5062 Transitive Closure</h2>
<div class="outline-text-2" id="text-47">
<p>
Este foi o problema F da Regional de Jakarta 2010. Dicas podem ser
encontradas <a href="http://www.suhendry.net/blog/?p=1389">aqui</a>.
</p>
</div>
</div>

<div id="outline-container-org345554c" class="outline-2">
<h2 id="org345554c"><span class="section-number-2">48</span> LA 5063 Just Sum It</h2>
<div class="outline-text-2" id="text-48">
<p>
Este foi o problema G da Regional de Jakarta 2010. Dicas podem ser
encontradas <a href="http://www.suhendry.net/blog/?p=1389">aqui</a>.
</p>
</div>
</div>

<div id="outline-container-org099b080" class="outline-2">
<h2 id="org099b080"><span class="section-number-2">49</span> LA 5064 Serial Numbers</h2>
<div class="outline-text-2" id="text-49">
<p>
Este foi o problema H da Regional de Jakarta 2010. Dicas podem ser
encontradas <a href="http://www.suhendry.net/blog/?p=1389">aqui</a>.
</p>
</div>
</div>

<div id="outline-container-org7414c31" class="outline-2">
<h2 id="org7414c31"><span class="section-number-2">50</span> LA 5065 Romantic Date</h2>
<div class="outline-text-2" id="text-50">
<p>
Este foi o problema I da Regional de Jakarta 2010. Dicas podem ser
encontradas <a href="http://www.suhendry.net/blog/?p=1389">aqui</a>.
</p>
</div>
</div>

<div id="outline-container-orga8e32ec" class="outline-2">
<h2 id="orga8e32ec"><span class="section-number-2">51</span> LA 5066 Fire Drill</h2>
<div class="outline-text-2" id="text-51">
<blockquote>
<p>
<i>Dicas escritas por Leonardo Blanger.</i>
</p>
</blockquote>

<p>
Este problema pode ser resolvido com uma combinação de uma busca em
largura (BFS) para calcular a distância das células até a saída e de
uma programação dinâmica para decidir quais voluntários
escolher. Quando um voluntário for escolhido é preciso ir até ele e
carregá-lo de volta, portanto, custo de escolher um voluntário é 3
vezes a distância dele até a saída.
</p>

<ul class="org-ul">
<li>Complexidade: A busca possui complexidade linear, enquanto a PD é
\(O(NS)\).</li>
</ul>
</div>
</div>
