dicas.html

<div id="outline-container-org84e379a" class="outline-2">
<h2 id="org84e379a"><span class="section-number-2">52</span> URI 1912 Help Seu Madruga</h2>
<div class="outline-text-2" id="text-52">
<blockquote>
<p>
<i>Dicas escritas por João Winckler.</i>
</p>
</blockquote>

<p>
Queremos encontrar a altura onde Seu Madruga deve fazer o corte, para
tal usamos uma busca binária. A altura do corte, se for possível, vai
estar entre 0 e a altura máxima dos papéis. Quando fazemos busca
binária em um valor double, ao invés de compararmos se o inicio é menor
ou igual ao fim para abortarmos a busca, repetimos o algoritmo X vezes, que
sabemos que será o suficiente para conseguirmos a resposta correta. Ao
fim da busca, checamos se a área formada pelo corte é igual a
área desejada com o erro de precisão de 4 casas decimais. Para fazer isso,
subtraímos a área obtida com o corte da área desejada, se o valor
absoluto do resultado for menor a 10<sup>-4</sup>, a resposta está
correta. Caso contrário, é impossível fazer um corte que resulte na
área desejada.
</p>

<ul class="org-ul">
<li>Complexidade: A busca binária tem complexidade \(O(\log N)\), mas para
cada busca devemos passar por todos os papéis para descobrir qual é a área
formada pelo corte, resultando na complexidade \(O(N\log N)\).</li>
</ul>
</div>
</div>

<div id="outline-container-orgfd2bc5f" class="outline-2">
<h2 id="orgfd2bc5f"><span class="section-number-2">53</span> URI 1856 Arya's Death List</h2>
<div class="outline-text-2" id="text-53">
<blockquote>
<p>
<i>Dicas escritas por Matheus Dall Rosa.</i>
</p>
</blockquote>

<p>
Este problema pode ser resolvido utilizando setorização por raiz
quadrada. Esta técnica consiste na separação de um vetor de tamanho N
em aproximadamente \(\frac{N}{\sqrt{N}}\) setores de tamanho
\(\sqrt{N}\), assim podemos iterar sobre todos os setores em \(O(\sqrt{N})\),
cada setor pode ser representado por uma struct que possui o id da
primeira pessoa do setor, o id da última pessoa do setor e a
quantidade de pessoas pertencentes a este setor, o que vai ser útil
para podermos efetuar a respota da query de tipo Q.
</p>

<p>
Antes de começarmos a responder as operações devemos pré-processar o
vetor de pessoas da entrada, primeiramente mapearemos cada pessoa do
intervalo \(1..10^9\) para o intervalo \(1..5 \cdot 10^4\), o que pode ser feito
através de um map, cada id após ser mapeado deve ser inserido em uma
lista encadeada e o seu iterador deve ser armazenado em um vetor de
iteradores IDX[\(1..5 \cdot 10^4\)], o id de seu setor também deve ser salvo em
um vetor setID[\(1..5 \cdot 10^4\)].
</p>

<p>
Resposta da query do tipo R e:
Primeiramente buscamos o identificador de e no intervalo \(1..5 \cdot 10^4\)
chamaremos este identificador de ei, e então buscamos o iterador de ei
em IDX[ei] para fazermos a remoção da pessoa da lista encadeada e
então a remoção da pessoa do próprio map utilizado para o mapeamento,
devemos também diminuir a quantia de pessoas no intervalo ao qual ei
pertence e também resolvermos alguns casos de borda por ex: quando ei
é o primeiro ou último elemento do setor.Complexidade: \(O(1)\) para
retirarmos a pessoa da lista e \(O(\log{N})\) para retirarmos do map,
resultando em \(O(\log{N})\).
</p>

<p>
Resposta da query do tipo I p e:
Primeiramente buscamos o identificador de p e e no intervalo 1..5
&sdot; 10<sup>5</sup>
chamaremos estes de kp e ke respectivamente, acessamos o iterador de
ke na lista encadeada através de IDX[ke] e então inserimos kp a frente
de ke na lista, após isso devemos inserir kp no primeiro setor com id
maior ou igual ao setID[kp] que possui espaço livre, esta parte da
operação exige o controle sobre o tamanho do setor e também se
precisamos de um novo setor, após encontramos um setor livre devemos
incrementar sua quantidade. Complexidade: Por causa da procura por um
setor com espaço livre esta operação pode custar no pior caso
\(O(\sqrt{N})\), também devemos buscar os identificadores o que custa
\(O(\log{N})\), resultando em \(O(\sqrt{N} + \log{N})\).
</p>

<p>
Resposta da query do tipo Q a b:
Primeiramente buscamos o identificador de a e b no intervalo \(1..5
  \cdot 10^5\) chamaremos estes de ka e kb respectivamente, acessamos os
ids de seus setores em setID[ka] e setID[kb] fazemos a varredura de
todos os setores neste no intervarlo setID[ka]..setID[kb] fazendo a
contagem do total de pessoas. Complexidade: No pior caso essa
varredura pode custar O(sqrt(N)).
</p>

<ul class="org-ul">
<li>Complexidade: Com o processamento de todas as Q operações teremos uma
complexidade final de \(O(Q \cdot (\sqrt{N} + \log{N}))\).</li>
</ul>

<blockquote>
<p>
<i>Dicas escritas por Leonardo Blanger.</i>
</p>
</blockquote>

<p>
Solução alternativa: A princípio, eu pensei em resolver da seguinte
forma. Ler e armazenar toda a lista inicial e as consultas, sendo que
para cada comando de inserção, eu inseria o elemento em uma lista
encadeada (sempre mantendo o iterador de cada valor guardado, para não
precisar percorrer a lista toda). Para remoções e consultas de
intervalo, eu não fazia nada.
</p>

<p>
No final, todos os elementos que pudessem vir a aparecer no problema
estariam na lista, em uma ordem relativa com os que estariam ao mesmo
tempo. Então eu simplesmente itero sobre a lista, desde o início, e
guardo as posições de cada elemento na lista em um vetor <code>pos[]</code>,
iniciando em 1.
</p>

<p>
Percorrendo a lista inicial e as consultas novamente, para cada inserção
eu atulizo uma BIT da seguinte forma:
</p>

<ul class="org-ul">
<li>Inserção: <code>update(pos[p[i]], 1)</code></li>
<li>Remoção: <code>update(pos[e[i]], -1)</code></li>
<li>E para saber a posição de um elemento: <code>query(a[i])</code></li>
</ul>

<p>
Quando eu fizer a query, apenas os que estiverem antes de <code>a[i]</code>, naquele
suposto momento serão contados.
</p>

<p>
De início eu levei WA, até ver a solução do Matheus, em que ele havia
mapeado os valores para um intervalo menor. Eu fiz o mesmo, substituindo
cada novo valor a ser inserido por um outro valor, e levei Accept. Isso
foi preciso porque, pelo viso, um inimigo removido pode voltar para a
lista em algum momento, substituindo o valor que ele tinha em <code>pos[]</code>.
</p>

<p>
As leituras e as inserções na lista, podem ser feitas em tempo linear,
se for guardado o nó em que cada valor está.
</p>

<ul class="org-ul">
<li>Complexidade: Pra percorrer elas novamente atualizando a BIT:
\(O((N+Q)log(n))\)</li>
</ul>
</div>
</div>

<div id="outline-container-org7402973" class="outline-2">
<h2 id="org7402973"><span class="section-number-2">54</span> URI 1852 Stark Direwolves</h2>
<div class="outline-text-2" id="text-54">
<blockquote>
<p>
<i>Dicas escritas por Leonardo Blanger.</i>
</p>
</blockquote>

<p>
  Este problema é uma aplicação do Stable Matching Problem.
Como estamos dando preferência para as crianças, o algoritmo funciona assim:
Enquanto houver uma criança sem lobo, que ainda não tiver percorrido toda a sua lista de lobos, tentar associar esta criança com o melhor lobo possível. Se este lobo estiver livre, associa-se eles, se não, confere-se se a preferência do lobo por esta criança for maior do que a preferência pela criança com que ele está associado atualmente. Se sim, a criança com que o lobo está associado se torna livre, e a criança atual se associa com este lobo.
</p>

<ul class="org-ul">
<li>Complexidade: De acordo com a Wikipedia, a complexidade é de
\(O(n^2)\). <a href="https://en.wikipedia.org/wiki/Stable_marriage_problem">link</a></li>
</ul>
</div>
</div>
